package com.lec.java.inheritance_review;


public class Inheritance_Review {
	public static void main(String[] args) {
//		문제 1. 상속이란 무엇인가?
//		TODO
		
		
		
		
		
		
		
		
//		문제 1. BasicTV 라는 클래스를 만들어라. -- 이걸 만들고 우선 각 종류별로 출력하라.
		// 멤버 변수
//		boolean isPowerOn;
//		int channel;
//		int volume;
//		
//		// 메소드
//		public void displayInfo() {
//			System.out.println("--- TV 현재 상태 ---");
//			System.out.println("전원: " + isPowerOn);
//			System.out.println("채널: " + channel);
//			System.out.println("볼륨: " + volume);
		
//		TODO
		
		
		
//		문제 1. 상속을 시키기 위해 사용하는 예약어는 무엇인가? cathode_ray_tube_television 클래스를 만들어 상속을 하는 구문을 직접 작성해봐라.
//		TODO
		
		
		
		
		
//		문제 1. 베이직티비 클래스를 상속시켜 스마트 티비라는 클래스를 만들어라. (클래스를 만드는 창에서 직접선택해서)
//		TODO
		
		
		
		
		
//		문제 1. 스마트 티비안에 ip라는 맴버 변수를 만들고 ip주소를 설정할 수 있는 메소드를 만들어줘라.
//		TODO
		
		
		
		
		
//		문제 1. 이 후 스마트티비 디스플레이인포를 만들고 메인에서 출력해라.
//		TODO
		
		
		
		
		
		
		
//////////////////////////////////////여기까지가 inherit01//////////////////////////////////////////
		
		
		
//////////////////////////////////////여기부터 inherit02//////////////////////////////////////////
		
//		문제 1. 상위클래스를 정의하는 용어들과 하위 클래스를 정의하는 용어를 다 작성해봐라.
//		상위  클래스  = 3개
//		하위 클래스 = 3개
//		상속받는다라는 뜻의 동사는?(영어로 적어라.)
//		TODO
		
		
		
		
		
		
//		문제 1. 상속의 이점에 대해서 작성하라. 새로운 객체가 가지는 이점을 위주로 작성
//		TODO
		
		
		
		
		
		
		
//		문제 1. BasicTV tv1 = new BasicTV(); 여기서 어디까지가 레퍼런스 변수고 어디까지가 인스턴스 생성문인가?
//		TODO
		
		
		
		
		
		
//		문제 1. 자바에서는 다중 상속이 허용되는가?
//		TODO
		
		
		
		
//		문제 1. 상속을 하는 직접적인 이유는 무엇인가?
//		TODO
		
		
		
//////////////////////////////////////여기까지 inherit02//////////////////////////////////////////
		
///////////////////////////////////////////////////여기부터가 03////////////////////////////////////////
		
		
//		문제 1. 모든 자바클래스는 무엇을 상속받는가?
//		TODO
		
		
		
		
		
		
//		문제 1. 불린타입도 숫자타입도 아닌것은 어떤 것으로 초기화 되는가?
//		TODO
		
		
		
		
		
		
		
//////////////////////////////////////////////////여기까지가 03////////////////////////////////////////
		
		

		
		
//////////////////////////////////////여기부터가 inherit04//////////////////////////////////////////

//		문제 1. 자식클래스는 자신이 생성되기 전에 무엇을 생성하는가?
//		TODO
		
		
		
		
		
		
		
		
//		문제 1. 자식클래스의 생성자에서 명시적으로 부모클래스가 호출되지 않으면 무엇이 호출 되는가?
//		TODO
		
		
		
		
		
		
		
//		문제 1. 자식 클래스의 생성자에서 명시적으로 부모 클래스의 생성자가 호출 시키는 방법은 무엇인가?
//		2가지(모르면 바로 봐) > (부모의 생성자를 명시적으로 호출)
//		TODO
		
		
		
		
		
		
		
//		문제 1. super는 항상 어디에 위치해야되는가?
//		TODO
		
		
		
		
		
		
		
		
//		문제 1. Vehicle, Car, Hybrid 세가지의 클래스를 만들어라. 순서대로 상속받게 만들어라. 추가 인스턴스변수 & 메소드는 1개씩만 넣어라. 
//		TODO

		
		
		
		
		
		
		
//		문제 1. 만약 상위 클래스에서 기본생성자가 없으면 하위 클래스에서는 어떤 현상이 발생하는가?
//		TODO
		
		
		
		
		
		
		
//		문제 1. 각 클래스를 불러오고 이 클래스들이 인스턴스될 때 어떤 현상이 일어나는지 출력결과를 통해 설명하라.
//		TODO
		
		
		
		
		
		
		
		
//////////////////////////////////////여기까지가 inherit04//////////////////////////////////////////
		
		
//////////////////////////////////////여기부터 inherit07//////////////////////////////////////////
//		문제 1. 메소드 오버라이딩과 메소드 오버로딩의 차이점을 정확히 설명하라.(한국어로 둘다 뭐라고 부르는가?)
//		TODO
		
		
		
//		문제 1. 클래스와 메소드를 상수로 정의할 때 어디에서 정의해야 되는가?(부모클래스?  or 자손클래스?)
//		TODO
		
		
		
//		문제 1. 클래스와 메소드를 상수로 정의할 때 어디에 final이 위치하는가?
//		TODO
		
		
		
//		문제 1. 클래스를 상수로 설정하면 어떤 문제가 발생하는가?
//		TODO
		
		
		
//		문제 1. 메소드를 상수로 설정하면 무엇을 할 수 없는가?
//		TODO
		
		
		
//		문제 1. 메소드 오버라이딩 시 생기는 것을 무엇이라 부르고 어떤 형태로 나타나는가?
//		TODO
		
		
		
//		문제 1. 주소를 출력할 때 사실은 어떤 클래스의 어떤 메소드가 생략되어 있는 것인가?
//		TODO
		
		
		
//		문제 1. People과 BusinessPeople 클래스를 만들고 BusinessPeople이 People을 상속받게 만들고 오버라이딩을 시켜라.
//		 메소드로는 이름을 작성하는 메소드를 오버라이딩 하게 해라.(showInfo()로 정하자.)
//		이후 오버라이딩 된 showInfo의 내용을 부모클래스와 자손클래스에서 각각 출력해보고 차이점에 대해 이야기 하여라.
//		TODO
		
		
		
//		문제 1. 오브젝트 클래스의 메소드 : toString()을 오버라이딩을 통해 원하는 값이 출력되게 만들어라.
		
		
		
//		TODO
//		문제 1. 상속을 염두해두고 맴버변수를 작성할 때는 어떤 수식어로 시작하는게 국룰인가?
		
		
		
		
		
//////////////////////////////////////여기까지가 inherit07//////////////////////////////////////////
		
		
		
		
		
		
	} // end main
} // end class
