package com.lec.java.class_review;

public class Class_Review {
	public static void main(String[] args) {
		System.out.println(" Class Review 시작합니다.");
		
//		문제 1. 클래스란 무엇이며(오브젝트부터 인스턴스까지 이어지는 과정에 대한 설명 필수 모르면 드라이브 내 15_1ppt 참조!)
//		TODO
		
		
		
//		문제 1. 클래스에서 지정하는 변수는 지역변수인가 매개변수인가?
//		TODO
		

		
		
		
//		문제 1. 생성자는 어떤 역할을 하는가?
//		TODO
		
		
		
		
//		문제 1. 지역변수는 사용전 반드시 무엇을 해주어야 하는가?
//		TODO

		
		
		
		
		
//		문제 1. 클래스 내에서 클래스가 가지는 고유 특성을 정의한 변수를 무엇이라 하는가?
//		TODO

		
		
		
		
		
		
//		문제 1. TV라는 새로운 클래스를 만들고 해당 클래스가 가지는 특성과 기능을 정의하라
//		[기능은 특성을 반영하여 제작되는게 원칙이다. 즉, 볼룸이라는 특성이 있으면 볼륨업, 볼륨다운이 있다.]
//		TODO
		
		
		
		
		
		
		
//		문제 1. 만든 클래스를 메인으로 가지고 오는 구문을 작성하시오 (그리고 구성요소를 설명하시오 구문에 사용된 것은 어떤건지 어떤 기능을 하는지)
//		TODO
		
		
		
		
		
		
//		문제 1. 클래스내에 해당 클래스의 전반적인 상태를 볼 수 있는 메소드를 만들어라.
//		TODO
		
		
		
		
//		문제 1. 기능을 정의하는것은 무엇으로 정의하는가?
//		TODO
		
		
		
		
		
		
//		문제 1. 인스턴스는 무슨 기능을 하는가?
//		TODO
		
		
		
		
		
		
//		문제 1. 제작한 클래스를 메인으로 불러와라
//		TODO
		
		
		
		
//		문제 1. 각 기능이 정상작동하는지 확인하라.
//		TODO
		
		
		
		
		
		
//		문제 1. 조정된 현재 클래스 상태를 호출하라.
//		TODO
		
		
		
		
		
//		문제 1. 클래스에서 정의한 메소드들에는 기존 메소드와 다르게 이것이 빠져있다. 이건 무엇일까?
//		TODO
		
		
		
		
		
//		문제 1. 상태와 기능을 정의할 때는 메소드로 정의한다.
//		TODO
		
		
		
		
		
		
		
	} // end main

} // end class
