package com.lec.java.for_review;

public class For_Review {
	public static void main(String[] args) {
		System.out.println("11월 21일 Java class 중  For에 applicable되는 Review를 Start합니다.");
		
		
		/* 문제 1. 순환문의 종류에 대해 나열하라
		1)
		2)
		3)
		*/
		
		// 문제 2. for순환문 구문에 대해 작동 순서를 작성하라.
		

		/* 문제 3. "hello java" + 1~5 를 출력해주는 순환문을 만들어라.   
		 * >>> ex) hello java 1, 다음은  자바 2 다음은 자바3 이런식으로 쭉
		 * 3-1. 총 몇번 순환하는 가?
		 * 3-2. 순환중에 사용된 인덱스값의 시작값과 끝값은? 
		 * 3-3. 순환문이 끝난뒤 인덱스값은?
		
		
		
		
		*/
		// 문제 4. 1~10 순서로 출력하는 순환문과 10~1순서로 출력되는 순환문을 각각 만들어라
		
		
		
		// 문제 5. 순환이 끝난 변수 2개를 그냥 따로 출력해보아라. > for의 어떤 특성이 반영된 수가 나오는가? (힌트는 for의 작동순서)
		
		
		
		// 문제 6. 순환문을 디버깅하면 for에서 스텝오버시 어떤 현상을 볼 수 있는가?
		
///////////////////////////////////////////// 여기까지 01입니다. //////////////////////////////////////////////

		
		
		
		
///////////////////////////////////////////// 여기부터 02입니다. //////////////////////////////////////////////
		
		
		// 문제 7. 구구단 2단을 출력하는 for구문을 만들어라.
		
		
		
		
		// 문제 8. for안에서 선언한 변수들을 밖에서 출력하면 어떻게 되는가?
		
		
		
		// 문제9. 2x2, 3x3, 4x4, 5x5, 6x6, 7x7 ... 9x9까지 출력되는 for구문을 만들어라.
		
		
		
///////////////////////////////////////////// 여기까지 02입니다. //////////////////////////////////////////////
		
		

///////////////////////////////////////////// 여기부터 03입니다. //////////////////////////////////////////////
		
		
		// 문제 10. 1~10 중에서 짝수만 출력하는 for구문을 만들어라. (2가지 방식)
		
		
		
		
		
		
///////////////////////////////////////////// 여기까지가 03입니다. //////////////////////////////////////////////		
		
		
///////////////////////////////////////////// 여기부터 04입니다. //////////////////////////////////////////////		
		
		
		// 문제 11. 1~100 수 중에서 2와 7의 공배수만 출력하는 for구문을 만들어라.
		
		
		
		
///////////////////////////////////////////// 여기까지 04입니다. //////////////////////////////////////////////		
		
		
		System.out.println("Review를 END합니다.");
		
		
	} // end main
} // end class	