package com.lec.java.array_review;

import java.util.Arrays;
import java.util.Scanner;

public class Array_Review {
	public static void main(String[] args) {
		
//		문제 1. 배열의 뜻과 선언하는 방식을 설명하라.
		
		
		
//		문제 1. 배열의 길이를 확인하는 방법은?
		
		
		
		
		
//		문제 1. 배열의 원소를 확인하는 방법은?
		
		
//		문제 1. 배열을 new로 생성하면 어떤일이 일어나는가??(3가지)  -  19.11.26 틀린문제
		
		
		
//		문제 1. 반 학생들의 국어점수를 통합하여 변수에 담고 각 점수를 출력하여라.(3개만)
		// 3가지 방식으로 출력 { 
//			1) 배열 선언 따로, 초기화 따로    
//			2) 배열을 선언과 동시에 초기화 1,2 }
		// 참고로 1) 또는 2)_2가 제일 효율적이다.
		
		
				
//		문제 1. 위 내용을 for을 통해 한번에 출력하여라.(각각)  -  19.11.26 틀린문제
		
		
		
//		문제 1. 만약 어레이 지정 범위를 벗어나버리면 어떻게 되는가?
		
		
		
//		문제 1. 0으로 변수를 자동초기화 시킨 후 0부터 50의 숫자가 출력되는 array와 for을 활용한 구문을 만들어라.
		
		
/////////////////////////////////////여기까지가 array01 입니다./////////////////////////////////		

		
		
		
		
/////////////////////////////////////여기부터 array02 입니다./////////////////////////////////		

//		문제 1. array와 같이쓰는 for은 sysout처럼 활용이 가능하다. 단축키로 한번 구문을 작성해봐라
		
		
//		문제 1. 수학점수의 총점과 평균 계산 해서 출력해라
		
		
		
//		문제 1. 기존 변수처럼 System.out.println(); 안에 array의 이름을 넣으면 무엇이 출력되는가? 
		
	
/////////////////////////////////////여기까지 array02 입니다./////////////////////////////////	
		
		
		
/////////////////////////////////////여기부터 array03 입니다./////////////////////////////////		
		
//		문제 1. array 안의 원소들을 리스트안에 가둬서 전체 출력하려면 어떤 예약어를 사용해야 하는가?   -   19.11.26 틀린문제 
		
		
		
		
//		문제 1. 위 기능을 활용해 캐릭터 타입의 array를 통해 "정동욱 300억 자산가 프로그래머"를 도출해라 
		
		
		
		
//		문제 1. 위 기능을 활용해 스트링 타입의 array를 통해 "정동욱 경비니 그리고 우리 가족들과 항상 행복한 시간을 보내게 됨"을 도출해라 
		
		
		
		
		
		
/////////////////////////////////////여기까지 array03 입니다./////////////////////////////////	
		
		
		
/////////////////////////////////////여기부터 array04 입니다./////////////////////////////////		
		/* 문제 1. 길이 5개 int 형 배열을 선언하고 사용자로부터 5개 정수를 입력받아 초기화 한뒤 
		          총점, 평균, 최대값, 최소값  출력
		 */
		
		
		
		
		
		
		
/////////////////////////////////////여기까지 array04 입니다./////////////////////////////////		
	
	
		
		
		
		
		
/////////////////////////////////////여기부터 array05 입니다./////////////////////////////////		
//		문제 1. 컴퓨터의 기본구성요소 3가지는 무것인가?
		 
		
		
//		문제 1. cpu는 무엇만을 인식가능한가? 그리고 그것을 위해 보조기억장치는 어떤 행위를 하는가?
		
		
		
		
		
//		문제 1. 자바는 cpu가 프로그램을 실행시키면 무슨 일을하는가?
		
		
		
		
//		문제 1. 구분된 장소들의 이름을 나열하시오(3가지)
		
		
		
		
		
//		문제 1. 메모리의 저장 단위는? 그리고 데이터는 항상 어떤것을 가지는가?

		
		
		
		
//		문제 1. stack의 구성요소와 생성시기 소멸시기를 말하라.
		
		
		
		
		
		
//		문제 1. heap의 구성요소와 생성시기 소멸시기를 말하라.
		
		
		

//		문제 1. method area의 구성요소와 생성시기 소멸시기를 말하라.
		
		
		
		
//		문제 1. int [] koreans = new int[3]; 을 스텍에 들어가는 것과 힙에 들어가는 것으로 나누고
//		각 타입을 어떤 타입으로 부르는지 작성하라.

		
		
		
		
//		문제 1. '3, 4, 5, 6, 7, 8'을 원소로 하는 1차원 배열과 2차원 배열을 각각 만들어라
//		      (2차원 배열은 원소 3개를 가지는 형태로 표현)

		
		
		
		
		
//		문제 1. 2차원 배열의 각각 원소들을 출력하라(2차원 배열 내 1차원 배열의 원소값)
		
		
		
		
		
		
//		문제 1. 2차원 배열의 길이를 측정하라, 그리고 2차원 배열 내 1차원 배열의 길이를 측정하라.
		
		
		
		
		
		
//		문제 1. 위 2차원 배열을 for문을 활용하여 출력하라.
		

		
		
		
//		문제 1. 위 1차원 배열과 2차원 배열을 강화된 for (enhanced for)을 활용해 출력하라.(Array10에 내용인데 쉬우니까 걍 하자)
		
		
		
		
//		문제 1. 위 1차원 배열과 2차원 배열의 주소를 출력하고 차이점을 설명하라.(16진수로 표현된 부분이 다른거 말고)

		
		
		
/////////////////////////////////////여기까지 array05 입니다./////////////////////////////////		
	
	
	
	
		
/////////////////////////////////////여기부터 array13 입니다./////////////////////////////////		
		
//		문제 1. 각 종 Arrays의 종류에 대해 나열하라(6종) 모르면 바로 봐
		

		
		
//		문제 1. 위 1차원 배열을 활용하여 Arrays기능들을 모두 시연하라.
		
		
		
		
//		문제 1. 위 2차원 배열을 활용하여 Arrays 기능 중 리스트형태로 출력하는 기능을 사용해보고 무엇이 출력되는지 이야기하라.
		
		
		
		
/////////////////////////////////////여기까지 array13 입니다./////////////////////////////////		
		
		
		
	
	
	} //end main
} // end class
