package com.lec.java.review;

public class Review {
	public static void main(String[] args) {
		
	// [1]"Hello World" 를 출력하라.
		
	// [2]java는 무엇을 이용하여 java에서 사용한 용어들을 2진수 용어로 바꿔주는가?
		
	// [3]모든 자바 프로그램은 "_____"에서 시작해야 된다. 빈칸에 맞는 말은?  + 빈칸에 해당되는 내용을 만드는 단축키는?
	// 이 과정을 하지 않으면 블럭스테이트먼트를 정확하게 규정하지 않은 상태가 되기 때문에 에러가 발생한다.

	// [4]항상 문장 또는 튜플, 딕셔너리, 라이브러리등은 "_____" 으로 마무리하게 된다. 빈칸은?
		
	/* [5]줄바꿈이 가능한 프린트 형식과 줄바꿈이 불가능한 프린트형식을 구분하여라.
		1) 줄바꿈 가능 : "줄바꿈이 가능합니다."
		2) 줄바꿈 불가능 : "줄바꿈이 불가능합니다."
	*/
		
	// [6]4칙연산과정을 제작하고 나누기의 특성에 대해 특성을 설명할 수 있는 프린트형식들을 만들어 넣어라.
		// 문자열과 숫자열을 같은 프린트 안에 넣으려면 , 기호가 아니라 + 기호로 정의 해줘야한다.
		
		
	/* [7]문자열의 add에 대해 그 특징에 대해 숫자열이 문자열 좌우에 붙어 더해지는 프린트 내용을 만들어 설명하여라
		1) 계산이 되어지는 순서는? (왼쪽?, 오른쪽?)  
		2) 숫자열과 문자열이 더해질 시 어디 쪽으로 편입되는가?
		3) 그 이유는 무엇인가? 
		4) 튜플을 사용하여 정상적인 문자열 기준 좌,우 모두 정상적인 계산이 되게 만들어라.
	*/ 	
		
		
	/* [8] 백슬레쉬를 통해 사용할 수 있는 것들을 아는데로 기술하라. (총 4가지)
		1) 
		2) 
		3) 
		4) 
	*/	
		
		
	/* [9] 각종 단축키
	   1)선택된 행을 통째로 아래행에 복사 : 
	   2)선택된 행을 통째로 위 또는 아래 행으로 이동(위치가 바뀜) :  
	   3)System.out.print() 단축키 :
	   4)선택된 행을 오른쪽으로 1탭 옮김 : 
	   5)public static void main(String[] args) {} 단축키 : 
	   6)제일 위 또는 제일 아래로 이동 : 
	   7)글자 크기 조정 단축키 : 
	*/
		
		
	// [10]저장한 파일을 다른 컴퓨터에서 불러오는 법
	//	export를 시킬 때 제너럴에 아카이브 파일로 내보낸 다음
	//	import 시킬 땐 제너럴에 existing projects into Workspace로 들어가서 select archive file에 아카이브 파일을 불러와주는게 가장 안정적으로 불러와진다.

		
	}
}	



