package com.lec.java.access_review;


public class Review_Main {
	
	
	
	public static void main(String[] args) {
//		문제 1. 접근권한 수식어 4가지에 대해 나열하고 이것의 기능은 무엇이며 각각이 불러올 수 있는 범위를 나열하시오.
//		TODO
		
		
		
//		문제 1. 클래스의 접근제한자의 종류에 대해 설명하라. 2가지
//		TODO
		
		
		
		
		
		
		
//		문제 1. 같은 패키지 안에 Test01 클래스를 만들어라.
		
//		"인스턴스변수"!!!!!!는 이렇게 선언 
//		private int privateNum;
//		int defaultNum;
//		protected int protectedNum;
//		public int publicNum;
		
		
//		메소드는 이렇게 선언
//		private void privateMethod() { // 노란줄은 경고이다. - 안쓴건데 왜 이렇게 해놨냐
//			System.out.println("Test01 - private method");
//		}
//		
//		void defaultMethod() {
//			System.out.println("Test01 - defaul method");
//		}
//		
//		
//		protected void protectedMethod() {
//			System.out.println("Test01 - protected method");
//		}
//		
//		public void publicMethod() {
//			System.out.println("Test01 - public method");
//		}		
		

//		TODO
		
		
		
		
		
		
		
		
		
		
		
//		문제 1. only_review패키지 안에 Test02 클래스를 만들어라.
		
//		"인스턴스변수"!!!!!!는 이렇게 선언 
//		private int privateNum;
//		int defaultNum;
//		protected int protectedNum;
//		public int publicNum;
		
//		메소드는 이렇게 선언
//		private void privateMethod() { // 노란줄은 경고이다. - 안쓴건데 왜 이렇게 해놨냐
//			System.out.println("Test01 - private method");
//		}
//		
//		void defaultMethod() {
//			System.out.println("Test01 - defaul method");
//		}
//		
//		
//		protected void protectedMethod() {
//			System.out.println("Test01 - protected method");
//		}
//		
//		public void publicMethod() {
//			System.out.println("Test01 - public method");
//		}

//		TODO
		
		
//		문제 1. 만들었다면 test01과 test02를 출력했을 때 차이점에 대해 설명하시오.
//		test01은 무엇이 되고 test02는 무엇이 안되는지
//		TODO
		
//		문제 1. 클래스를 위와 같은 방식으로 출력한다면 default로 선언한 것과 public으로 선언한 것이 다른 결과로 나타나게 된다.
//		하지만 인스턴스변수나 클래스변수를 불러올 때 문제와 클래스를 불러올 때의 문제가 근본적으로 어디서 차이가 나는가???     // 존나 중요
//		TODO
	
		
		
//////////////////////////////////////////////////////여기까지 access05///////////////////////////////////////////////////////
		
		
//////////////////////////////////////////////////////여기부터 Final///////////////////////////////////////////////////////
		
//		문제 1. 맴버변수는 상수로 지정이 가능한가? 가능하다면 소문자로 표현되는가 대문자로 표현되는가? 
//		TODO
		
		
//		문제 1. 문자열 전체를 대문자로 바꾸는 단추기와 소문자로 바꾸는 단축키에 대해 설명하라.
//		TODO
		
		
//		문제 1. 지역변수에서 상수를 지정할 때와 클래스변수(인스턴스변수)에서 상수를 지정할 때의 가장 큰 차이점은 무엇인가?
//		TODO
		
		
//////////////////////////////////////////////////////여기까지 Final///////////////////////////////////////////////////////
		
//////////////////////////////////////////////////////여기부터 Static01Main///////////////////////////////////////////////////////
		
//		문제 1. 클래스변수와 인스턴스변수의 차이점에 대해 설명하라.
//		TODO
		
		
		
		
//		문제 1. 메인과 클래스 사이에 클래스메소드와 인스턴스 메소드를 둘다 선언해라.
//		이 때 스캐너까지 추가로 작성하고 스캐너는 무슨 변수가 되는지 작성해라.
//		TODO
		
		
		
		
		
//		문제 1. 스테틱으로 선언된 메인안에 논스테틱메소드 사용이 가능한가?
//		TODO
		
		
		
		
		
//		문제 1. 불가능하다면 어떻게 써야되는가??  -  틀린 문제
//		TODO
		
		
//		문제 1. 위에 방법을 이용하여 인스턴스변수와 스캐너변수를 둘다 메인에서 나타나게 작성하라.
//		TODO
		
		
		
		
		
		
		
//		문제 1. 메인에서 작성한 스캐너와 인스턴스변수로 작성한 스캐너의 차이점에 대해 설명하라.
//		TODO
		
		
		
		
		
//////////////////////////////////////////////////////여기까지 Static01Main///////////////////////////////////////////////////////
		
//////////////////////////////////////////////////////여기부터 Static02Main///////////////////////////////////////////////////////
		
//		문제 1. 클래스 변수를 선언한 test클래스를 하나 만들어라.
//		멤버변수는 인트타입으로 인스턴스변수와 클래스변수 각각 1개씩 만들어라.
		
//		클래스의 메소드는 
//		show(); // 인스턴스 매소드 
//		show2(); // 클래스 매소드 
//		두가지를 만들어라.
//		이 때 각각의 메소드는 
//		System.out.println(클래스변수 출력);
//		System.out.println(인스턴스변수 출력);
//		을 포함하게 만들어라.
		
//		이 때 어디서 애러가 나는가? 
//		TODO
		
		
		
		
		
		
//		문제 1. 이 후 show()와 show2()메소드를 메인으로 불러와라.
//		TODO
		
		
//		문제 1. 각각 인스턴스 변수와 클래스 변수를 출력하도록 하라. 이 때 '클래스 변수'의 값만 특정하여 지정해줘라.
//		TODO
		
		
		
		
		
//		문제 1. show2()의 클래스 변수값을 지정하고 출력하였다면 다시 show()을 그냥 출력해봐라! 무슨 일이 일어났는가?
//		TODO
		
		
		
		
		
//		문제 1. 왜 저런 일이 일어났는지 설명하라.
//		TODO
		
		
		
		
		
//		문제 1. 이 특성을 활용해 Test라는 클래스의 인스턴스가 생겨날 때 마다 클래스변수의 값이 1씩 증가하게 만들어라.
//		TODO
		
		
		
		
		
		
//		문제 1. 클래스변수나 인스턴스변수를 메인에서 직접사용할 때 주의해야 될 것은 무엇인가?
//		TODO

		
		
		
		
//		문제 1. 스테틱의 특징 3가지는 무엇인가?
//		TODO
		
		
		
		
		
//////////////////////////////////////여기까지가 Static 02 /////////////////////////////////////////////////////
		
		
		
		
//////////////////////////////////////여기부터가 Static 03 /////////////////////////////////////////////////////
//		문제 1. Singleton 싱글톤 디자인 패턴은 무엇을 뜻하는가?
//		TODO
		
		
		
		
//		문제 1. 싱글톤 디자인 패턴을 만들 때 변수와 생성자는 무엇으로 수식어를 다는가?
//		TODO
		
		
		
		
//		문제 1. 그럼 무엇과 무엇을 활용해 메인으로 클래스의 값이 불려올 수 있게 만드는가?(2가지 중요사항)
//		TODO
		
		
		
		
//		문제 1. Tests라는 싱글톤디자인패턴을 활용한 클래스를 만들고 맴버변수, 생성자를 다 지정해준 뒤 getInstance라는 메소드를 만들고 이걸 통해 메인에서 테스트 클래스의 값이 불려오게 만들어라.
//		TODO
		
		
		
		
		
//		문제 1. 전에 배운 내용을 통해 Test내에 2가지 메소드를 만들어서 인스턴스 변수를 100으로 바꾸고 출력해줘라.
//		TODO

		
		
		
//		문제 1. 싱글톤의 예로 Object에서 불러올 수 있는 메소드를 만들고(이름 안알려줄거지롱~) 메인에서 출력해라.
//		TODO

		
		
		
		
//////////////////////////////////////여기까지가 Static 03 /////////////////////////////////////////////////////

	
	} // end main
} // end class
