package com.lec.java.loop_review;

public class Loop_Review {
	public static void main(String[] args) {
		System.out.println("REVIEW START");
//		문제1. 반복문을 멈추게 하는 예약어는?
//		Break;
		
		
		
//		문제2. 1 ~ 10을 출력하는 while 문에서 3이 되면 멈추는 형태로 만들어라.
		int n = 1;
		while (n <= 10) {
			System.out.println(n);
			n++;
			if (n > 3) break;
		}
		
		
		
//		문제3. 1 ~ 100까지의 숫자 중 2와 7의 첫번째 공배수가 출력되는 while문을 만들고 28이 출력되면 반복문이 멈추게 만들어라.	
		int n1 = 1;
		while (n1 <= 100) {
			if(n1 % 2 == 0) {
				if(n1 % 7 == 0) {
					System.out.println(n1 + " = 2와 7의 공배수입니다.");
					n1++;
					if(n1 > 28) break; 
				} // end if
			} // end if
			
			n1++;
			
		} // end while
		
		
		
/////////////////////////////////////////////// 여기까지가 Loop 01 ////////////////////////////////////////////////////////
		
		
		
		
		
		
/////////////////////////////////////////////// 여기부터 Loop 02 ////////////////////////////////////////////////////////

		
//		문제4. break로 나간 상태에서 다시 돌아오게 하는 예약어는 무엇인가?
//		continue
		
		
		
		
		
//		뭄제5. 위 예약어를 활용하여 홀수값만 출력되는 while문을 만들어라.
		int s = 1;
		while (s <= 100) {
			if (s % 2 == 0) {
				continue;
			} else {
				System.out.println("출력! = " +  s);
				if (s == 100) break;
				s++;
			} // end if
			s++;
			if (s == 100) break;
			
		} // end while
		
		
		
		
//		문제 6. 구구단을 변형해서 출력하라   -  19.11.23 틀린문제
		// 2단은 x 2 까지 출력
		// 3단은 x 3 까지 출력    쭈욱 9단까지 같은 방식으로
		
		for(int a = 2; a <= 9 ; a++) {
			
			System.out.println(a + "단");
			
			for(int b = 1; b<= 9; b++) {
				if(b > a) continue;
				System.out.println(a + " x " + b);
			}
			System.out.println();
		}
		// for로 하면 쉬운데 왜 while로 하면 어려울까....
		
		
		
		
/////////////////////////////////////////////// 여기까지가 Loop 02 ////////////////////////////////////////////////////////

		
		
		
		
		
/////////////////////////////////////////////// 여기부터 Loop 03 ////////////////////////////////////////////////////////
		
		
		//		문제7. 중첩 for과 중첩 while을 활용하여 각각 구구단 2단부터 9단까지 출력하여라
		for (int a = 2; a <= 9; a++) {
			System.out.println(a +
					"단");
			for(int b = 1; b <= 9; b++ ) {
				System.out.println(a + " X " + b);
			}
			System.out.println();
		}
		
		
		int a = 2;
		while (a <= 9) {
			
			System.out.println("  " + a + "단");
			
			int b = 1;
			while(b <= 9) {
				System.out.println(a + "X" + b);
				b++;
			} // end while
			
			a++;
			System.out.println();
			
		} // end while
		
		
		
		
		
		
		
/////////////////////////////////////////////// 여기까지가 Loop 03 ////////////////////////////////////////////////////////

		
		
		
/////////////////////////////////////////////// 여기부터 Loop 04 ////////////////////////////////////////////////////////
		
		
		//		문제8. 2단은  단 x 2부터,  3단은  단 x 3 부터 출력되는 구구단 for구문을 만들어라.(9단까지 다 해야됭)    -  19.11.23 틀린문제

		
		for (int dan = 2; dan <= 9 ; dan++) {

			System.out.println(dan + "단");  //이걸 이렇게 넣어주면 단 안에서 각 단에서 단 이름이 한번씩 나온다. 
			for(int i = 1; i <= 9; i++) {
				if (dan > i) continue;  // 문자 출력이 되기 전에 할건지 되고 나서 할 건지가 굉장히 중요하다.
				System.out.println(dan + " x " + i);

				
			} // end for
			System.out.println();  // 이걸 이렇게 넣어주면 단수가 바뀔 때 뛰어쓰기를 한다.

		} // end for
		

//?????????????????????????????????    이건 왜 출력이 안되는지 여쭤보기            ??????????????????????????????????????
//		int dan2 = 2;
//		while (dan2 <= 9) {
//			System.out.println(dan2 + " 단");
//			int i2 = 2;
//			while (i2 <= 9) {
//				if (dan2 > i2) continue;
//				System.out.println(dan2 + " X " + i2);
//
//				i2++;
//			}
//			i2++;
//			dan2++;
//			
//		}
		
		
		
		
		
		
/////////////////////////////////////////////// 여기까지가 Loop 04 ////////////////////////////////////////////////////////
		
		
		
		
//////////////////////////// 추가로 반복제어문1. "형성평가04번"    +  "자기진단04" 두 개 풀어봐  ///////////////////////////////////////
		
		
		
		
		
		
		
	}
}
