package com.lec.java.thread_review;

public class Thread_Review {
	public static void main(String[] args) {
		
//		문제. Thread는 무엇인가?
//		TODO
		
		
		
		
		
//		문제. Thread는 기본적으로 누구의 통제를 받는가?
//		TODO
		
		
		
		
		
//		문제. Thread를 추가 하고 싶을 땐 기본적으로 무엇을 만들어주어야 하는가?
//		TODO
		
		
		
		
		
//		문제. 자 그럼 쓰레드를 사용하는 순서 4가지에 대해 설명하고 "Hello Java!"와 "Hello 동욱"를 100번 출력하는 새로운 Thread를 각각 만들어 보아라.
//		해당 쓰레드가 몇번째 쓰레든지 카운트하는 변수도 만들어 넣어라.
//		TODO
		
		
		
		
		
//		문제. 출력했을 때 순서는 어떻게 되는가? 순서가 있이 출력이 되는가?
//		TODO

		
		
		
		
		
//		문제. 해당 Thread의 이름을 지정해주고 싶을 때 사용하는 예약어는 무엇이며 주로 어디에 들어가는가?
//		TODO
		
		
		
		
		
//		문제. 한번 Start한 쓰레드는 재사용이 가능한가? 다시 사용하려면 어떻게 해야되는가?
//		TODO
		
		
		
		
		
		
	////////////////////////////////////////////////////////여기까지가 01///////////////////////////////////////////////////////
		
		
		
		
		
		
	////////////////////////////////////////////////////////여기부터가 02///////////////////////////////////////////////////////

		
//		문제. 자바는 기본적으로 다중 상속을 지원하는가?
//		TODO
		
		
//		문제. 그럼 다중 상속을 받기 위해 어떻게 해야하는가?
//		TODO
		
		
//		문제. 위 개념을 Thread서 활용하기 위해 사용하는 예약어의 이름은 무엇인가? 또한 이것은 어떤 객체인가?
//		TODO
		
		
		
//		문제. 이것을 활용하기 위한 순서를 설명하면서 실제로 제작햅라.(5단계)
//		TODO
		
		
//		문제. Anonymous class 로도 생성해보라
//		TODO
		
		
//		문제. Lambda-expression 로도 생성해보라 (이 때 출력되는 것을 0.15초씩 딜레이 시켜서 출력해보라.)
//		TODO
		
	
		////////////////////////////////////////////////////////여기까지가 02///////////////////////////////////////////////////////
		
		
		
		
		
		////////////////////////////////////////////////////////여기부터가 04///////////////////////////////////////////////////////
		
//		문제. 쓰레드에 시간 배분을 하는 우선순위결정이 가능한가??
//		TODO
		
		
//		문제. 어떻게 결정할 수 있는가?
//		TODO
		
//		문제. 몇단계부터 몇단계까지 범위값을 설정할 수 있는가?
//		TODO
		
//		문제. 기본값은 몇인가?
//		TODO
		
		
//		문제. 쓰레드의 우선순위를 변경하는 기능으로 사용되는 예약어는 무엇인가? 또한 이것은 어디에 주로 위치하는가?
//		TODO
		
		
//		문제. 위 기능에서 최대값과 최소값 그리고 기본값을 설정할 때 사용하는 예약어가 무엇인지 각각 사용해서 쓰레드를 출력해보라.
//		TODO
		
		
		
		////////////////////////////////////////////////////////여기까지가 04///////////////////////////////////////////////////////
		
		
		
		
		
		
		
		
		
		////////////////////////////////////////////////////////여기부터가 05///////////////////////////////////////////////////////
		
//		문제. 지정한 시간 동안 쓰레드가 실행되도록 두게 만드는 예약어는 무엇인가?
//		TODO
		
//		문제. 이 예약어를 사용하는 위치는 어디인가?(정확하게 어디안에 써야되나?)
//		TODO
//		문제. 쓰레드를 3개 (A,B,C) 만들고 위기능을 활용하여 B는 C가 끝나고 시작하게 설정하라.
//		TODO
//		문제. 위기능을 사용할 때 발생하는 문제점은 무엇이 있고 이것을 무엇이라 부르는가?
//		TODO
//		문제. 위기능은 주로 언제 사용되는가?
//		TODO
//		문제. 해당 thread의 내용물의 개당 출력시간을 딜레이시키는 예약어는 무엇인가?
//		TODO
		
		////////////////////////////////////////////////////////여기까지가 05///////////////////////////////////////////////////////
		
		
		
	} // end main
} // end Thread_Review class
