package com.lec.java.lambda_review;

public class Lambda_Review_Main {
	public static void main(String[] args) {
		
//		문제. lambda식은 왜 사용하게 되었는가?
//		TODO
//		문제. lambda식은 어떤 구조으로 작성되는가?
//		TODO
//		문제. lambda식은 어떤 것을 축약해서 나타내주는가?
//		TODO
//		문제. 인터페이스를 활용해 덧셈을 하는 메소드가 있는 클래스를 만들어 메인에서 값이 입력되면 그 값을 활용해 덧셈이 이뤄지게 만들어라.
//		TODO
//		문제. 위에 내용을 익명클래스를 이용해 만들어라.(anonymous class)
//		TODO
//		문제. 람다 클래스를 이용해 위 내용을 표현해보아라.
//		TODO
		
	/////////////////////////////////////////여기까지가 01////////////////////////////////////////////////////////

		
		
	/////////////////////////////////////////여기부터가 02////////////////////////////////////////////////////////
		
//		문제. 밑에 4가지에 해당하는 클래스를 각각 만들어서 람다식으로 표현하고 값을 출력하라.
		// 매개변수 없고, 리턴값도 없는 경우
		// 매개변수 한개, 리턴값은 없는 경우(매겨변수 타입의 이름 이딴 거  안 중요하고 개수만 중요)
		// 매개변수 여러개, 리턴값이 있슴.
		// 매개변수 한개, 내부 수행코드 여러줄.., 리턴값.
//		TODO
		
		
//		문제. 매개변수 안에 타입 표현가능한가? 가능하다면 제한사항은 없는가?
//		TODO
		
		
		
//		문제. 밑에 내용을 람다식으로 표현하고 값을 출력하라 
		// Test05 인터페이스 만들기
		// void printMax(double x, double y)
		// [출력양식 예제]
		// x = 3.14
		// y = 1.2
	    // 3.14 > 1.2
//		TODO
		
		
	////////////////////////////////////////////////////여기까지가 02///////////////////////////////////////////////////////////
	
		
		
	} // end main
} // end class
