package com.lec.java.switch_review;

public class Switch_Review_Main {
	public static void main(String[] args) {
		System.out.println("11월 21일 Java class 중  Switch에 applicable되는 Review를 Start합니다.");
		
		
		// 문제 1. 스위치 조건문이 if 조건문과 다른 점에 대해서 설명하라.
		
		// 문제 2. 스위치 조건문 내 조건이 총 4개가 되는 조건문을 만들어라. 안에 출력문구는 만들고 싶은데로
		

		// 문제 3. 스위치 조건문 내 주의사항에 대해 서술하라. 그리고 그 주의사항이 무엇 때문에 주의해야되는지도 설명하라.
		
		
		
		// 문제 4. switch 조건문 if - else if - else로 바꿀 수 있다. 위에서 작성한 내용을 바꿔서 작성하라.
		
		
///////////////////////////////////////////// 여기까지 01입니다. //////////////////////////////////////////////

		
		
		
		
///////////////////////////////////////////// 여기부터 02입니다. //////////////////////////////////////////////
		
		
		// 문제 5. switch ~ case 조건문을 사용해서 
		// 짝수 이면 --> "짝수입니다"  출력
		// 홀수 이면 --> "홀수입니다"  출력
		// 이후 정수 1을 변수지정하고 출력값 얻기
		
		
///////////////////////////////////////////// 여기까지 02입니다. //////////////////////////////////////////////
		
		

///////////////////////////////////////////// 여기부터 03입니다. //////////////////////////////////////////////
		
		
		// 문제 6. 기본적으로 switch는 int를 쓰는게 일반적이지만 int에서 형변이 가능한 타입들을 리스트형태로 출력하라.
		
		
		
		// 문제 7. char형태를 활용하여 a~d 까지 대소문자를 구분하여 무조건 대문자로 출력되는 switch구문을 만들어라.
		// 이 후 'c'를 출력해라.
		
		
		
		// 문제 8. switch에서 사용할 수 없는 타입들에 대해 나열하라.
		
		
///////////////////////////////////////////// 여기까지가 03입니다. //////////////////////////////////////////////		
		
		
///////////////////////////////////////////// 여기부터 04입니다. //////////////////////////////////////////////		
		
		
		// 문제 9. 문자열타입을 인식하는 switch구문을 이용해 해당 문자열이 있는 case가 실행되는 switch구문을 만들어라.
		
		
		
		
///////////////////////////////////////////// 여기까지 04입니다. //////////////////////////////////////////////		
		
		
		
///////////////////////////////////////////// 여기부터 05입니다. //////////////////////////////////////////////	
		
		// 문제 10. 새로운 타입을 만드는 예약어의 이름과 사용 위치에 대해 설명하라.
		
		
		
		
		// 문제 11. 위에서 사용한 예약어를 활용해 해당 요일을 출력하는 switch구문을 만들어라.(잘 모르겠으면 반드시 switch05열어서 확인해)
		
		
		
		
///////////////////////////////////////////// 여기까지 05입니다. //////////////////////////////////////////////	
		
		
		System.out.println("Review를 END합니다.");
		
		
	} // end main
} // end class	