package com.lec.java.while_review;

public class While_Review {

	public static void main(String[] args) {
		System.out.println("REVIEW START");
		
//		문제1. for과 while의 차이점에 대해 서술하시오 (작동 순서를 나누는 기준이 다르다. while의 최초식, 조건식, 증감식의 위치를 설명하라.)
//		for은 튜플안에 최초식 ; 조건식 ; 증감식이 모두 들어가지만 while은 입력전에 최초식이 밖에서 작성되고 while 괄호에는 조건식만 들어가며 블럭안에 증감식이 들어간다.
		
		
		
		
//		문제2. while의 조건식으로 1~ 10을 출력해라.
		int n = 1;
		while (n <= 10) {
			System.out.println(n);
			n++;
			if (n == 11) break;
		}
		System.out.println("n = " + n);
		
		
		
		
		System.out.println();
//		문제3. 문제 2를 역으로 출력하라.
		for(int n2 = 10 ; n2 >= 1 ; n2--) {
			System.out.println(n2);
		}
		
		
		
		
		
		
		/*
		int num = 10;
		while (num >= 1); { 
			System.out.println(num);
			num--; 
		}
		System.out.println("n1 = " + num);
		 */
		
//????????????????????????????????? 이거 왜 출력 안되는지 강사님께 질문해보자......???????????????????????????????????????
		
		
		
		
		
//////////////////////////////////////// 여기 까지가  while 01 ////////////////////////////////////////////////////////
		
		
		
		
		
		
		
//////////////////////////////////////// 여기 부터  while 02 ////////////////////////////////////////////////////////

		
		//		문제4. 구구단 2단 만들기
		int n2 = 1;
		int dan = 2;
		while (dan <= 9) {
			while (n2 <= 9) {
				System.out.println(dan + "x" + n2);
				n2++;
			}
			dan++;
		}
		
		
		
		
//////////////////////////////////////// 여기 까지가  while 02 ////////////////////////////////////////////////////////
		
		
		
		
		
		
//////////////////////////////////////// 여기 부터  while 03 ////////////////////////////////////////////////////////

		
		//		문제6. 1 ~ 10 중 홀수만 출력( 1)은 조건문 활용 2)은 조건문 활용 x)
//		1)
		int n3 = 1;
		while (n3 <= 10) {
			if(n3 % 2 == 0) {
				continue;
			} else {
				System.out.println(n3);
				n3++;
			}
			n3++;
		}
		
		
		
//		2)
		int n4 = 1;
		while (n4 <= 10) {
			System.out.println(n4);
			n4 += 2;
		}
		
		
		
		
		
		
//////////////////////////////////////// 여기 까지가  while 03 ////////////////////////////////////////////////////////
		
		

//////////////////////////////////////// 여기 부터  while 04 ////////////////////////////////////////////////////////

		
		//		문제 7. 1 ~ 100 수중에서 2와 7의 공배수 출력 (while 버전)
		int n5 = 1;
		while (n5 <= 100) {
			if ((n5 % 2 == 0) && (n5 % 7 == 0)) {
				System.out.println(n5 + " = 2와 7의 공배수 입니다.");
			}
			n5++;
		}
		
		
		
//////////////////////////////////////// 여기 까지가  while 04 ////////////////////////////////////////////////////////
		
		
		
		
		
		
		
		
		
//////////////////////////////////////// 여기 부터  do ~ while ////////////////////////////////////////////////////////

		
		//		문제 9. 일반 while문과 do while 문을 비교하여 차이점이 들어나게 프린트 하여라.
		
//		일반 while문은 밑에 처럼 작성하면 출려고디는 것이 없지만 do while문은 먼저 do에 해당 하는 내용이 실행되고 while문으로 들어가기 때문에 출력되는게 있다.
		
		
		System.out.println("일반 while 입니다.");
		int n6 = 1;
		while(n6 == 0) {
			System.out.println("출력되었습니다.");
		}
		System.out.println();
		
		
		System.out.println("do ~ while 입니다.");
		
		do {
			System.out.println(n6);
		} while (n6 <= 0); {
			System.out.println("출력되었습니다.");
		}
		
		
//////////////////////////////////////// 여기 까지가  do ~ while ////////////////////////////////////////////////////////
		
		

		System.out.println("REVIEW END");
	}

}
