package com.lec.java.array_review;

public class Array_Review {
	public static void main(String[] args) {
		
//		문제 1. 배열의 뜻과 선언하는 방식을 설명하라.
		
		
//		문제 1. 배열의 길이를 확인하는 방법은?
		
		
		
//		문제 1. 배열의 원소를 확인하는 방법은?
		
		
		
//		문제 1. 배열을 new로 생성하면 어떤일이 일어나는가??
//		1)
//		2)
//		3)
		
		
		
		
//		문제 1. 반 학생들의 국어점수를 통합하여 변수에 담고 각 점수를 출력하여라.(3개만)
		// 3가지 방식으로 출력( 1) 배열 선언 따로, 초기화 따로    2) 배열을 선언과 동시에 초기화 1,2)
		// 참고로 1) 또는 2)_2가 제일 효율적이다.
		
		
		
//		문제 1. 위 내용을 for을 통해 한번에 출력하여라.(각각)
		
		
		
//		문제 1. 만약 어레이 지정 범위를 벗어나버리면 어떻게 되는가?
		
		
		
		
//		문제 1. 0으로 변수를 자동초기화 시킨 후 0부터 50의 숫자가 출력되는 array와 for을 활용한 구문을 만들어라.
		
		
		
		
/////////////////////////////////////여기까지가 array01 입니다./////////////////////////////////		

		
		
		
		
/////////////////////////////////////여기부터 array02 입니다./////////////////////////////////		

//		문제 1. array와 같이쓰는 for은 sysout처럼 활용이 가능하다. 단축키로 한번 구문을 작성해봐라
		
		
//		문제 1. 수학점수의 총점과 평균 계산 해서 출력해라
		
		
//		문제 1. 기존 변수처럼 System.out.println(); 안에 array의 이름을 넣으면 무엇이 출력되는가? 
		
	
/////////////////////////////////////여기까지 array02 입니다./////////////////////////////////	
		
		
		
/////////////////////////////////////여기부터 array03 입니다./////////////////////////////////		
		
//		문제 1. array 안의 원소들을 리스트안에 가둬서 전체 출력하려면 어떤 예약어를 사용해야 하는가? 
		
		
		
//		문제 1. 위 기능을 활용해 캐릭터 타입의 array를 통해 "정동욱 300억 자산가 프로그래머"를 도출해라 
		
		
		
//		문제 1. 위 기능을 활용해 스트링 타입의 array를 통해 "정동욱 경비니 그리고 우리 가족들과 항상 행복한 시간을 보내게 됨"을 도출해라 
		
		
		
		
		
		
/////////////////////////////////////여기까지 array03 입니다./////////////////////////////////	
		
		
		
/////////////////////////////////////여기부터 array04 입니다./////////////////////////////////		
		/* 길이 5개 int 형 배열을 선언하고 사용자로부터 5개 정수를 입력받아 초기화 한뒤 
		          총점, 평균, 최대값, 최소값  출력
		 */
		
		
		
/////////////////////////////////////여기까지 array04 입니다./////////////////////////////////		
	
	
	
	
	
	
	}
}
