package com.lec.java.review.inner;

public class Review_Inner {
	public static void main(String[] args) {
		
//		문제. Inner Class(내부 클래스)안에 어떤 것들이 있는가 (총 크게는 3가지)
//		TODO
		
		
		
		
		
		
		
		
		
//		문제. Local class의 종류는 무엇인가?
//		TODO
		
		
		
		
		
		
		
		
//		문제.  IS-A와 HAS-A 관계에 대해 설명해봐라.
//		TODO

		
		
		
		
		
		
		
//		문제. HAS-A안에서 사용하는 것에는 어떤 것들이 있는가?(2종류)
//		TODO
		
		
		
		
		
		
		
//		문제. 그럼 위 내용을 토대로 InnerClass는 언제 사용되는가? 그리고 왜 그래야 하는가?
//		TODO
		
		
		
		
		
		
		
		
//		문제. Member Inner Class(멤버 내부 클래스)는 언제 사용되는가?
//		TODO
		
		
		
		
		
		
		
		
//		문제. 하나의 외부 클래스 인스턴스를 이용해서 몇개의 내부 클래스를 인스턴스할 수 있는가?
//		TODO
		
		
		
		
		
		
		
		
//		문제. 도대체 그럼 상속을 사용하지 않고 내부클래스를 사용하는 이유는 무엇인가??
//		TODO
		
		
		
//		문제. Member Inner Class(멤버 내부 클래스)를 만들 때 일반클래스를 만드는 것과 차이가 있는가?
//		TODO
		
		
		
		
//		문제. Member Inner Class(멤버 내부 클래스)는 어디에 위치되는가?
//		TODO

		
		
		
		
//		문제. Member Inner Class(멤버 내부 클래스)는 어떻게 인스턴스 할 수 있는가?
//		TODO
		
		
		
		
		
		
//		문제. Member Inner Class(멤버 내부 클래스)는 외부클래스의 어떤 것들을 사용할 수 있는가?
//		TODO
		
		
		
		
		
		
//		문제. 
		// 새로운 외부 클래스 인스턴스 생성
		// out1 외부 클래스 인스턴스 생성
		// out1 로 부터 in1, in2는 이름으로 내부 클래스 객체 만들기.
//		TODO
		
		

////////////////////////////////////////////////////////여기까지가  01/////////////////////////////////////////////////////////////		

		
		
		
		
////////////////////////////////////////////////////////여기부터 04/////////////////////////////////////////////////////////////	
		
//		문제. 아웃터 클래스의 맴버 클래스로 활용되는 클래스중 static이 활용된 클래스를 뭐라고 부르는가?
//		TODO
//		Nested class (중첩 클래스), static inner class
		
//		문제. 그냥 멤버 클래스와 어떤 면에서 차이점이 발생하는가?
//		TODO
//		외부클래스의 인스턴스를 생성하지 않고, 내부 클래스의 인스턴스를 생성할 수 있다.
		
//		문제. nasted class 안에 논스테틱 메소드를 사용 가능한가?
//		TODO
//		불가능
		
//		문제. int타입 맴버변수를 가지는 새로운 클래스를 만들고 숫자를 카운트하는 중첩클래스를 만들어라.
//		TODO
		
		
//		문제. 위에 지정한 중첩클래스를 메인으로 불러와라.
//		TODO
		

////////////////////////////////////////////////////////여기까지가  04/////////////////////////////////////////////////////////////		

////////////////////////////////////////////////////////여기부터  03/////////////////////////////////////////////////////////////	
		
//		문제. Local class가 앞서 본 클래스들과 다른 차이점이 무엇인가?
//		TODO
		
//		문제. Local class의 종류 2가지에 대해 말하여라.
//		TODO
		
		
//		문제. Local inner class는 언제 생성되고 언제 소멸되는가?
//		TODO
//		블록안에 클래스를 지정할 때 생성되고 블록을 벗어나면 그 정의 자체가 소멸된다.

//		문제. 다른 클래스들과 달리 무엇이 불가능한가?
//		TODO
//		public같은 수식어를 붙일 수 없다.
		
//		문제. effectively final 변수란 어떤 것과 어떤 것을 가리키는 말인가?
//		TODO
		
//		문제. Local inner class는 외부에서 어떤 값을 바꿀 수 없는가? 바꿀 경우 어떤일이 발생하고 왜 발생하는가?
//		TODO
		
//		문제. 임의의 클래스를 만들고 Local inner class를 만들어고 호출해보아라.
//		TODO
		
//		문제. Local inner class는 어디에서만 그 값을 활용할 수 있는가?
//		TODO
		
//		문제. Local inner class는 어떤 상활에서 활용할 수 있는가?
//		TODO
		
		

////////////////////////////////////////////////////////여기까지가  05/////////////////////////////////////////////////////////////		

////////////////////////////////////////////////////////여기부터  06/////////////////////////////////////////////////////////////	
		
//		문제.  final의 사용되는 곳과 사용되는 곳마다 어떤 역할을 하는지 쓰시오.(4군데)
//		TODO
		
		
		
		
		
//		문제. 엡스트렉트 타입의 클래스들의 특징에 대해 다시한번 설명해보아라.
//		TODO
		
		
		
//		문제. 아우터 클래스의 메소드 타입을 Local inner Class 타입으로 지정하는게 가능한 소린가? 왜 그런 결과가 나오는가?
//		TODO
		
		
//		문제. 이론적으로 메소드 내부에 정의된 지역 클래스 타입을 리턴하는 메소드는 만들 수 있나? 있으면 왜 가능하고? 없으면 왜 없나?
//		TODO
		
		
		
//		문제. 근데 굳이 굳~~잉이이이이이잉!!! Local inner class자체를 타입으로 삼아서 리턴형식으로 이 자체를 내보내고 싶으면 어떻게 해야되는지 4단계로 나누어 설명하라.
		// 메소드는 이름과 나이를 출력하는 메소드로 만들어라.
//		TODO 
		
		
//		문제. 다 만들었으면 메인에서 이값들을 불러와서 초기화 시키고 출력해라.
//		TODO
		
		

////////////////////////////////////////////////////////여기까지가  06/////////////////////////////////////////////////////////////		

////////////////////////////////////////////////////////여기부터  07/////////////////////////////////////////////////////////////	
		
//		문제. Anonymous inner class는 다른말로 뭐라고도 부르는가?(2가지)
//		TODO
		
		
//		문제. 이름이 없기 때문에 무엇을 만들수가 없는 클래스인가?
//		TODO
		
//		문제. 그럼 인스턴스는 어떻게 시키는가?
//		TODO
		
//		문제. 이건 기본적으로 어떤 것을 리턴하는가? 또 그것을 위해 어떤 것을 준비해야 되는가?
//		TODO
		
//		문제. 그럼 Anonymous inner class를 직접 만들어보아라. (메소드는 이름과 나이를 리턴하는 형식으로 제작해라.)
//		TODO
		
//		문제. 만든 Anonymous inner class 메인으로 불러와 이름 정동욱 나이 26을 출력해라.
//		TODO
	

////////////////////////////////////////////////////////여기까지가  07/////////////////////////////////////////////////////////////		

////////////////////////////////////////////////////////여기부터  08/////////////////////////////////////////////////////////////
		
//		4칙연산을 하는 Local class를 만들어라.(4칙연산 다 만들어라.) 클래스 생성부터 메인에 불러오는 것 까지 한번에 하면됨
		
//		문제. 1. 익명클래스 사용하지 않을 경우
//		TODO
		
		
		
		
		
//		문제. 2. 익명클래스 사용하는 경우
//		TODO
		
		
		
		
		
//		문제. 위와 같이 특정 추상 메소드만 implement 하는 목적으로 설계되는 인터페이스의 이름은 보통 뒤에 무엇이 붙는가?
//		TODO
		
		
		
		
		
		
////////////////////////////////////////////////////////여기까지가  08/////////////////////////////////////////////////////////////
		
			
		
	} // end main
} // end class
