package com.lec.java.review;

public class Review_Main {
	public static void main(String[] args) {
		// 문제 1. 연산과정에서 두 변수 값을 바꾸는 방법
		// 변수 2가지를 만들고 두 값을 서로 바꾸어라.
		
		
		
		
		
		
		// 문제 2. 변수의 최초 초기화를 2가지 방식을 통해 프린트해라.
		
		
		
		
		
		// 문제 3. 두 변수를 만들고 두 변수가 같은 값을 가지게 만들어라. 
		// 그리고 이를 통해 대입연산자가 어디서부터 연산을 시작하는지 설명하라.
		
		
		
		
		/* 문제 4. 복합대입연산자들의 종류에 대해 작성하고 각각의 기능에 대해 설명하라.
		1)
		2)
		3)
		4)
		5)
		6)
		*/
		
		
		
		
		/* 문제 5. 단항연산자의 종류 및 기능에 대해 설명하라.
		 * 1)
		 * 2)
		 * 3)
		*/
		
		
		
		// 문제 6. " int num1 = -10; " 앞에 문자열 안에 존재하는 연산자의 총 개수는 몇개인가?
		
		
		
		
		
		// 문제 7. 11과 -22를 각각 변수를 지정해 주고 변수를 통해 프린트를 할 때 33이 나오는 알고리즘을 짜라.
		
		
		
		
		
		// 문제 8. 코딩하는 문서들의 연산자들이 정리되어 있지 않을 때 컴퓨터에게 대신 정리해달라고 요청하는 방법에 대해 설명하라.
		// 그냥 내가 들어가서 하는법과 단축키 2가지로 나눠서 설명
		
		
		
		
		
		// 문제 9. 증감연산자의 종류 및 기능에 대해 설명하라.
			
	
		
		
		
		// 문제 10. 증감연산자를 표현하는 2가지 방식에 대해 서술하고 각각의 차이점에 대해 서술하라.
		
		
		
		
		
		// 문제 11. 관계(비교)연산자는 어떤 타입으로 리턴하는가?
		
		
		
		
		/* 문제 12. 관계 연산자의 종류에 대해 설명하고 각 기능에 대해 작성하라.
		1)
		2)
		3)
		4)
		5)
		6)
		*/
		
		
		
		
		// 문제 13. 대입연산자와 다른 연산자를 같이쓰일 때 대입연산자는 항상 어디에 위치하는가?
		
		
		
		
		
		// 문제 14. 실수타입을 비교할 때 해서는 안되는 비교연산에 대해 작성하고 그 이유를 서술하라.
		
		
		
		
		// 문제 15. 비교연산자, 논리연산자, 대입연산자 간의 우선순위를 표기하여라
		
		
		
		/* 문제 16. 논리연산자의 종류에 대해 서술하고 각 기능을 설명하라.
		1)
		2)
		3)
		4)
		*/
		
		
		// 문제 17. 20이라는 값을 가지는 변수를 지정하고 논리연산자의 종류별로 각각 true값과 false값이 나오게 조정하여라.
		
		
		
		
		
		// 문제 18. Lazy Evaluation이 무슨 의미인지 and와 or의 개념을 이용해 각각 어떻게 작동되는지 설명하라.
		
		
		
		
		/* 문제 19. 비트연산자의 종류에 대해 작성하고 각 기능이 어떤 연산과정을 가지는지 작동원리를 설명하라.
		1)
		2)
		3)
		4)
		특별출현 ★5)
		특별출현 ★6)
		*/
		
		
		
		// 문제 20. 십진수 10과, 7을 변수로 지정하고 비트연산자별로 값이 나오게 만들어라.
		
		
		
	}
}
