package com.lec.java.review;

public class Review {
	public static void main(String[] args) {
		
	//변수에 정수타입을 설정하고 그 값을 출력하라.


	//변수에 실수타입을 설정하고 그 값을 출력하라.
	
		
		
	/*
	 [타입정리 및 각 타입별 바이트수와 2의 몇승인지 표기]
	 
	1. 정수타입
	 
	2. 실수타입의 종류는
	 
	3. 문자타입의 종류는
	 
	4. 논리타입의 종류는
	 
	*/	
		
	
	/* 
	[[진법]]
		1. 2진법 표기 원리는?
	
		2. 16진법에서 10이상을 표기하는 방법은? 	
	
	*/
		
	/*	
	[Byte]
		1. Byte는 2의 몇승?
	
		2. Byte는 몇 bit?
	
	[1Byte가 표현할 수 있는 범위값] 
		1. 2진수일 때 범위값?
	
		2. 10진수일 때 범위값?
	
		3. 16진수일 때 범위값?
		
		4. 프로그래머들이 16진수를 선호하는 이유는?

		
		5. 2진수, 8진수, 10진수, 16진수의 이름을 적어라.
		
		
		6. 각 타입들(정수,실수,문자,논리 다!)이 가질수 있는 범위의 최대값 최소값을 구해 출력되게 만들고 long과  float의 최대값을 기입할 시 에러가 뜨는 이유를 설명하라.
		(기본적으로 타입을 설정할 때 무엇을 주의해야되고 long과 float은 어떤 기본적인 원리 때문에 에러가 뜨는건지 설명)
		추가로  실수타입의 최소값 최대값에서 나오는 E의 정의에 대해 설명하라.
		
		
	*/
		
		
	/*
	[정수 리터럴 표기]
		1.  실행창에서 사전을 실행해서 프로그래머전용 계산기로 바꾼뒤 10진수의 321을 2진수, 8진수, 16진수에서 어떻게 나타내는지 봐라
		
		2.  확인했으면 각 진수별로 실제 '321'을 표현해라 >>> 이게 어렵네
		 1) 2진수(앞이 0b으로 시작)
		 2) 8진수 (앞이 0으로 시작)
		 3) 10진수
		 4) 16진수(앞이 0x으로 시작)
		 
		 */
				
		
		
	}
}
